#include <iostream>
#include <algorithm>

using namespace std;

struct class5
{
    int m;
    string n;
};

bool cmp(class5 a, class5 b)
{
    return a.m > b.m;
}

int main()
{

    class5 a[55];
    srand((unsigned)time(NULL));
    for (int i = 1; i < 50; i++)
    {
        a[i].m = rand();
    }
    a[1]="李玮楠";
    a[2]="陈锦川";
    a[3]="林舒恩";
    a[4]="王佳业";
    a[5]="蔡卓琳";
    a[6]="郭一梵";
    a[7]="杨泽祺";
    a[8]="梁滔";
    a[9]="赖艳鹏";
    a[10]="黄彬源";
    a[11]="谢嘉欢";
    a[12]="林晓东";
    a[13]="雷昊禧";
    a[14]="谢淑君";
    a[15]="马家豪";
    a[16]="刘坚豪";
    a[17]="王文威";
    a[18]="吴中其";
    a[19]="谢城";
    a[20]="何泳良";
    a[21]="黄贝苗";
    a[22]="黄俊";
    a[23]="商汇川";
    a[24]="陈佳浚";
    a[25]="陈诗伟";
    a[26]="曾宇璐";
    a[27]="旷恒毅";
    a[28]="李晓芳";
    a[29]="陈隽淇";
    a[30]="吴凡";
    a[31]="丁汉基";
    a[32]="张宁炬";
    a[33]="香南斌";
    a[34]="沈德增";
    a[35]="徐旗";
    a[36]="林芷泳";
    a[37]="李志成";
    a[38]="王仁杰";
    a[39]="李志文";
    a[40]="王玮璟";
    a[41]="谭恩泽";
    a[42]="潘国俊";
    a[43]="谭鹏";
    a[44]="陈佳茵";
    a[45]="罗仕鑫";
    a[46]="蒋泽明";
    a[47]="邓子曼";
    a[48]="陈芷茵";
    a[49]="王凯峰"
    sort(a + 1, a + 50, cmp);
    cout << endl << "### 评分人员抽取 - 以下结果仅用于测试非最终结果" << endl;
    cout << "抽取结果：" << " ";
    for (int i = 1; i < 5; i++)
        cout << a[i].n << " ";
    cout << endl;
    return 0;
}
